
const postsArray = [
    {
        id: 1,
        title: 'Заголовки HTTP',
        content: {
            text: 'Это заголовки. Бла-бла-бла. Солнце греет, но пятки мёрзнут. Что делать с этим знают только камыши. Стоят ночами и днями они в тёплой грязи. Мне же ногу греет мотор. Он закреплен под седлом, пьёт бензин... Бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла...',
            code: '',
            image: '',
            video: '',
        },
        tags: ['html', 'http'],
    },
    {
        id: 2,
        title: 'Это просто очень длинный заголовок, который не поместится в одну строку.',
        content: {
            text: 'А это очень долгий пост, тут написано то же самое что и в первом посте, но два раза. Это сделано чтобы появилась полоса прокрутки в боди. Вот ещё пара строк и всё. Чтобы написать то... ну, например, мне нравится реакт. Вот пожалуй и всё, этого достаточно. Всем добра! Это заголовки. Бла-бла-бла. Солнце греет, но пятки мёрзнут. Что делать с этим знают только камыши. Стоят ночами и днями они в тёплой грязи. Мне же ногу греет мотор. Он закреплен под седлом, пьёт бензин... Бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла... Это заголовки. Бла-бла-бла. Солнце греет, но пятки мёрзнут. Что делать с этим знают только камыши. Стоят ночами и днями они в тёплой грязи. Мне же ногу греет мотор. Он закреплен под седлом, пьёт бензин... Бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла...',
            code: 'const post = (props) => {...props}',
            image: '',
            video: '',
        },
        tags: ['react', 'jsx', 'verylongmonoworddfdfdfd'],
    },
    {
        id: 3,
        title: 'Это просто очень длинный заголовок, который не поместится в одну строку.',
        content: {
            text: 'А это очень долгий пост, тут написано то же самое что и в первом посте, но два раза. Это сделано чтобы появилась полоса прокрутки в боди. Вот ещё пара строк и всё. Чтобы написать то... ну, например, мне нравится реакт. Вот пожалуй и всё, этого достаточно. Всем добра! Это заголовки. Бла-бла-бла. Солнце греет, но пятки мёрзнут. Что делать с этим знают только камыши. Стоят ночами и днями они в тёплой грязи. Мне же ногу греет мотор. Он закреплен под седлом, пьёт бензин... Бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла... Это заголовки. Бла-бла-бла. Солнце греет, но пятки мёрзнут. Что делать с этим знают только камыши. Стоят ночами и днями они в тёплой грязи. Мне же ногу греет мотор. Он закреплен под седлом, пьёт бензин... Бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла-бла...',
            code: 'const post = (props) => {...props}',
            image: '',
            video: '',
        },
        tags: ['react', 'jsx', 'c-sharp', 'javascript', 'visual-studio-code'],
    },
];

export default postsArray;